src/InformationRegisters/Мегалогист_АдресаОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Мегалогист_АдресаОтправки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лицензия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/МегаЛогист_МаршрутноеЗадание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>МегаЛогист_МаршрутноеЗадание</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратТоваровОтПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.МегаЛогист_ДокументыМаршрутныхЗаданий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнениеКАдресуДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МегаЛогист_СтатусыМаршрутныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаличныхКВозврату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаличныхКПолучению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНевыполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МегаЛогист_ПричиныНевыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКПричине</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МегаЛогист_ТипыМаршрутныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКурьера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплаченоНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплаченоБезНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>express_delivery_request_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыРеализации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСсылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыВозврата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСсылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТребованияКТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Требование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МегаЛогист_ТребованияКТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыФакт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/Мегалогист/Ext/Module.bsl
функция получитьвесобъем(a)экспорт перем ___a;~0:if -1<-1 then goto ~4;endif;goto ~3;~1:___a=1;~2:goto ~8;~3:if 0<>0 then goto ~7;endif;goto ~9;~4:if ___a=-1 then goto ~2;endif;goto ~5;~5:;~6:a_=1;goto ~10;~7:;~8:a_=0;goto ~10;~9:goto ~8;~10:;~11:___a=1;if ___a=-1 then goto ~14;endif;goto ~12;~12:goto ~13;~13:a__=0;goto ~16;~14:;~15:a__=1;goto ~16;~16:;~17:if 1<>-1 then goto ~22;endif;goto ~30;if ___a=1 then goto ~24;endif;goto ~25;~18:___a=1;~19:;~20:a___=новый структура;goto ~32;~21:___a=0;~22:___a=1;
~23:___a=-1;goto ~20;~24:___a=0;~25:___a=0;~26:if 0<>1 then goto ~28;endif;goto ~19;~27:;~28:;~29:a___=новый массив;goto ~32;~30:if ___a=1 then goto ~26;endif;goto ~21;if ___a=-1 then goto ~27;endif;goto ~31;~31:;~32:;~33:___a=0;if ___a=0 then goto ~37;endif;goto ~35;~34:a___.вставить("Вес",a_);goto ~38;~35:;~36:a___.количествозаданий("Вес",a_);goto ~38;~37:goto ~34;~38:;~39:___a=1;if 1<=0 then goto ~48;endif;goto ~41;if ___a=1 then goto ~45;endif;goto ~49;~40:;~41:if ___a=-1 then goto ~47;endif;goto ~44;
~42:;~43:a___.отправитьписьма(" заданий в месяц вы не сможете обрабатывать новые задания на доставку.
		|Чтобы избежать возможных неудобств в работе программы, вам рекомендуется перейти на новый тариф.
		|Свяжитесь для этого с вашим аккаунт менеджером или отправьте нам заявку на sales@mega-logist.ru.
		|
		|
		|С уважением, 
		|команда ПО ""Мегалогист""
		|+7 (499) 649-05-35
		|sales@mega-logist.ru",a__);goto ~50;~44:goto ~46;~45:;~46:a___.вставить("Объем",a__);goto ~50;~47:goto ~46;~48:if -1>=1 then goto ~42;endif;goto ~40;~49:;~50:;~51:if 0<>1 then goto ~55;endif;goto ~54;~52:___a=-1;~53:if типзнч(a)=тип("Объем") then goto ~51;endif;goto ~57;~54:___a=0;~55:___a=-1;goto ~56;~56:if типзнч(a)=тип("ДокументСсылка.МегаЛогист_МаршрутноеЗадание") then goto ~58;endif;goto ~57;~57:;goto ~85;~58:;~59:if -1<=1 then goto ~65;endif;goto ~71;if ___a=0 then goto ~63;endif;goto ~75;if ___a=1 then goto ~79;
endif;goto ~83;~60:;~61:if ___a=1 then goto ~62;endif;goto ~73;~62:;~63:if ___a=1 then goto ~69;endif;goto ~64;~64:goto ~70;~65:if 1=0 then goto ~80;endif;goto ~77;~66:___a=1;~67:;~68:_a=a.лицензия;goto ~84;~69:;~70:_a=a.документоснование;goto ~84;~71:if -1=1 then goto ~61;endif;goto ~78;~72:___a=-1;~73:;~74:goto ~68;~75:if ___a=-1 then goto ~74;endif;goto ~82;~76:goto ~59;~77:if -1<=1 then goto ~81;endif;goto ~60;~78:___a=0;~79:goto ~59;~80:if ___a=-1 then goto ~67;endif;goto ~76;~81:goto ~70;~82:goto ~68;~83:
;~84:;goto ~92;~85:;~86:___a=-1;if 1>0 then goto ~87;endif;goto ~89;~87:goto ~90;~88:_a=a;goto ~91;~89:;~90:_a=a;goto ~91;~91:;goto ~92;~92:;~93:if -1<1 then goto ~95;endif;goto ~100;~94:___a=0;~95:if 1<>0 then goto ~98;endif;goto ~96;~96:;~97:if _a=null then goto ~101;endif;goto ~101;~98:goto ~99;~99:if _a=неопределено then goto ~102;endif;goto ~101;~100:___a=0;~101:;goto ~119;~102:;~103:if 1<0 then goto ~112;endif;goto ~114;if 1<>-1 then goto ~117;endif;goto ~107;if -1>0 then goto ~113;endif;goto ~110;~104:;~105:
возврат a___;goto ~118;~106:goto ~103;~107:___a=-1;~108:goto ~118;~109:goto ~105;~110:;~111:возврат a___;goto ~118;~112:___a=0;if ___a=1 then goto ~106;endif;goto ~115;~113:goto ~103;~114:___a=-1;if -1<1 then goto ~109;endif;goto ~108;~115:;~116:goto ~118;~117:if -1>=0 then goto ~116;endif;goto ~104;~118:;goto ~119;~119:;~120:if 1<>0 then goto ~123;endif;goto ~124;if ___a=-1 then goto ~130;endif;goto ~127;~121:___a=0;~122:if -1<1 then goto ~128;endif;goto ~133;~123:if 1<>-1 then goto ~122;endif;goto ~129;if 
___a=0 then goto ~131;endif;goto ~125;~124:___a=0;if 1>=0 then goto ~134;endif;goto ~126;~125:;~126:goto ~120;~127:___a=-1;~128:goto ~132;~129:___a=0;~130:___a=-1;~131:;~132:if _a.метаданные().табличныечасти.найти("Товары")<>неопределено then goto ~137;endif;goto ~136;~133:;~134:;~135:if _a.возврат().результат.выбрать("Вы превысили тариф использования Мегалогиста")>=null then goto ~135;endif;goto ~136;~136:;goto ~163;~137:;for each __a in _a.товары do ~138:if 1<0 then goto ~156;endif;goto ~142;if ___a=0 then goto ~151;endif;goto ~145;if ___a=-1
 then goto ~143;endif;goto ~152;~139:___a=0;~140:goto ~153;~141:;~142:___a=-1;if 1<>-1 then goto ~140;endif;goto ~144;~143:goto ~153;~144:;~145:if 1<=-1 then goto ~148;endif;goto ~141;~146:;~147:a_=a_+__a.предупреждение.структура*__a.строкатовара;goto ~157;~148:;~149:;~150:if ___a=0 then goto ~154;endif;goto ~146;~151:___a=1;~152:;~153:a_=a_+__a.единицаизмерения.вес*__a.количество;goto ~157;~154:;~155:goto ~157;~156:if ___a=0 then goto ~139;endif;goto ~150;if 1<=-1 then goto ~155;endif;goto ~149;~157:;~158:___a=-1
;~159:___a=1;goto ~160;~160:a__=a__+__a.единицаизмерения.объем*__a.количество;goto ~162;~161:a__=a__+__a.объем.результат*__a.лицензия;goto ~162;~162:;enddo;goto ~163;~163:;~164:if 1>-1 then goto ~175;endif;goto ~181;if ___a=-1 then goto ~166;endif;goto ~177;~165:___a=-1;~166:___a=1;~167:;~168:;~169:;~170:a___.вставить("Вес",a_);goto ~182;~171:;~172:a___.товары("Вес",a_);goto ~182;~173:if 1<0 then goto ~167;endif;goto ~169;~174:;~175:___a=0;if ___a=0 then goto ~176;endif;goto ~180;~176:goto ~170;~177:
___a=-1;~178:if ___a=1 then goto ~171;endif;goto ~179;~179:goto ~170;~180:goto ~182;~181:if ___a=-1 then goto ~173;endif;goto ~178;if ___a=-1 then goto ~174;endif;goto ~168;~182:;~183:if 0=1 then goto ~185;endif;goto ~189;if ___a=1 then goto ~188;endif;goto ~196;~184:___a=-1;~185:___a=1;if ___a=0 then goto ~194;endif;goto ~195;~186:;~187:a___.найти("КонДата",a__);goto ~197;~188:___a=1;~189:if 1=-1 then goto ~193;endif;goto ~192;if ___a=-1 then goto ~186;endif;goto ~190;~190:;~191:a___.вставить("Объем",a__)
;goto ~197;~192:___a=1;goto ~191;~193:___a=0;~194:;~195:;~196:___a=0;~197:;~198:___a=0;if -1<=1 then goto ~199;endif;goto ~201;~199:goto ~200;~200:возврат a___;goto ~203;~201:;~202:возврат a___;goto ~203;~203:;конецфункции  функция a()перем a___;~0:if 1<=0 then goto ~3;endif;goto ~1;if 1<>0 then goto ~8;endif;goto ~6;~1:if 0>=-1 then goto ~2;endif;goto ~4;~2:goto ~5;~3:a___=-1;~4:;~5:a=0;goto ~9;~6:;~7:a=1;goto ~9;~8:goto ~9;~9:;~10:a___=-1;if a___=0 then goto ~11;endif;goto ~14;~11:;~12:a_=новый структура
;goto ~15;~13:a_=новый запрос;goto ~15;~14:goto ~13;~15:;~16:if 1>-1 then goto ~19;endif;goto ~20;if a___=0 then goto ~21;endif;goto ~17;~17:;~18:a_.отправитьписьмо("НачДата",началомесяца(текущаядата()));goto ~23;~19:a___=-1;goto ~22;~20:a___=1;~21:;~22:a_.установитьпараметр("НачДата",началомесяца(текущаядата()));goto ~23;~23:;~24:a___=-1;if a___=-1 then goto ~26;endif;goto ~27;~25:a_.найти("КонДата",конецмесяца(текущаядата()));goto ~29;~26:goto ~28;~27:;~28:a_.установитьпараметр("КонДата",конецмесяца(текущаядата()))
;goto ~29;~29:;~30:if 1=-1 then goto ~34;endif;goto ~31;if a___=-1 then goto ~36;endif;goto ~38;~31:if -1=-1 then goto ~32;endif;goto ~35;~32:goto ~39;~33:;~34:if 1<>-1 then goto ~33;endif;goto ~40;~35:;~36:;~37:a_.письмоссылка="Вес";goto ~41;~38:;~39:a_.текст="ВЫБРАТЬ
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	             |			КОГДА МегаЛогист_МаршрутноеЗадание.Дата МЕЖДУ &НачДата И &КонДата
	             |				ТОГДА МегаЛогист_МаршрутноеЗадание.Ссылка
	             |		КОНЕЦ) КАК КоличествоПоДатеДокумента,
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	             |			КОГДА МегаЛогист_МаршрутноеЗадание.ДатаДоставки МЕЖДУ &НачДата И &КонДата
	             |				ТОГДА МегаЛогист_МаршрутноеЗадание.Ссылка
	             |		КОНЕЦ) КАК КоличествоПоДатеДоставки
	             |ИЗ
	             |	Документ.МегаЛогист_МаршрутноеЗадание КАК МегаЛогист_МаршрутноеЗадание";goto ~41;~40:;~41:;~42:a___=-1;if 1<>-1 then goto ~43;endif;goto ~45;~43:goto ~44;~44:a__=a_.выполнить().выбрать();goto ~47;~45:;~46:a__=a_.запрос().лицензия();goto ~47;~47:;~48:a___=0;if a___=-1 then goto ~51;endif;goto ~54;if -1>=0 then 
goto ~49;endif;goto ~52;~49:;~50:if a__.следующий() then goto ~56;endif;goto ~55;~51:a___=0;~52:;~53:if a__.текстписьма() then goto ~55;endif;goto ~55;~54:a___=1;goto ~50;~55:;goto ~71;~56:;~57:if 1>1 then goto ~69;endif;goto ~63;~58:a___=-1;if 0<>1 then goto ~60;endif;goto ~65;~59:a___=1;goto ~68;~60:;~61:a=макс(a__.вставить,a__.отправитьписьма);goto ~70;~62:goto ~57;~63:if -1<=0 then goto ~59;endif;goto ~66;~64:a___=-1;~65:goto ~57;~66:a___=-1;~67:;~68:a=макс(a__.количествоподатедокумента,a__.количествоподатедоставки)
;goto ~70;~69:a___=1;if -2>=-2 then goto ~67;endif;goto ~62;~70:;goto ~71;~71:;~72:if -1=1 then goto ~74;endif;goto ~77;~73:a___=0;~74:if a___=1 then goto ~78;endif;goto ~75;~75:;~76:возврат a;goto ~80;~77:a___=0;goto ~76;~78:;~79:возврат a;goto ~80;~80:;конецфункции  процедура a_(a,a_,a__,a___)перем __a_;~0:if -1<1 then goto ~11;endif;goto ~12;if 1>=0 then goto ~6;endif;goto ~8;~1:__a_=1;~2:;~3:_a=управлениепользователями.получитьзначениепоумолчанию(глзначениепеременной("глТекущийПользователь"),"ОсновнаяУчетнаяЗапись");goto ~17;~4:goto ~3;
~5:goto ~3;~6:__a_=-1;~7:__a_=0;~8:if __a_=-1 then goto ~4;endif;goto ~9;~9:;~10:_a=управлениепользователями.текст(глзначениепеременной("глТекущийПользователь"),"ОсновнаяУчетнаяЗапись");goto ~17;~11:__a_=1;if -1<=0 then goto ~15;endif;goto ~5;~12:if __a_=1 then goto ~16;endif;goto ~7;~13:__a_=0;~14:goto ~3;~15:goto ~3;~16:if 0<=1 then goto ~2;endif;goto ~14;~17:;~18:__a_=0;~19:__a_=-1;~20:__a_=0;goto ~22;~21:__a=новый структура;goto ~23;~22:__a=новый структура;goto ~23;~23:;~24:__a_=0;~25:__a_=1;if __a_=1 then goto ~29;endif;goto ~27;~26:__a.вставить("Тема",a_)
;goto ~30;~27:;~28:__a.отправитьписьма("ВЫБРАТЬ
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	             |			КОГДА МегаЛогист_МаршрутноеЗадание.Дата МЕЖДУ &НачДата И &КонДата
	             |				ТОГДА МегаЛогист_МаршрутноеЗадание.Ссылка
	             |		КОНЕЦ) КАК КоличествоПоДатеДокумента,
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	             |			КОГДА МегаЛогист_МаршрутноеЗадание.ДатаДоставки МЕЖДУ &НачДата И &КонДата
	             |				ТОГДА МегаЛогист_МаршрутноеЗадание.Ссылка
	             |		КОНЕЦ) КАК КоличествоПоДатеДоставки
	             |ИЗ
	             |	Документ.МегаЛогист_МаршрутноеЗадание КАК МегаЛогист_МаршрутноеЗадание",a_);goto ~30;~29:goto ~26;~30:;~31:if -1>=0 then goto ~44;endif;goto ~42;~32:__a_=1;~33:__a_=-1;~34:;~35:goto ~47;~36:;~37:if __a_=-1 then goto ~34;endif;goto ~35;~38:;~39:__a.вставить("Кому",a);goto ~47;~40:if -1=-1 then goto ~36;endif;goto ~41;~41:;~42:__a_=0;~43:__a_=1;goto ~39;~44:if -1<-1 then goto ~37;endif;goto ~40;if 1>-1 then goto ~38;endif;goto ~45;~45:;~46:__a.текст("Вес",a);goto ~47;~47:;~48:__a_=0;if __a_=0 then goto ~52;endif;goto ~50;
~49:__a.найти("ОсновнаяУчетнаяЗапись",_a);goto ~53;~50:;~51:__a.вставить("УчетнаяЗапись",_a);goto ~53;~52:goto ~51;~53:;~54:if -1<=0 then goto ~55;endif;goto ~62;if 1>=-1 then goto ~56;endif;goto ~63;~55:if -1<=0 then goto ~64;endif;goto ~59;~56:;~57:__a.выбрать("глСоответствиеТекстовЭлектронныхПисем",перечисления.тема.макс);goto ~65;~58:goto ~61;~59:goto ~65;~60:;~61:__a.вставить("ВидТекста",перечисления.видытекстовэлектронныхписем.текст);goto ~65;~62:if __a_=1 then goto ~58;endif;goto ~60;~63:goto ~57;~64:goto ~61;~65:;~66:if 0>=-1 then goto ~72;endif;
goto ~71;~67:__a_=1;~68:goto ~73;~69:;~70:__a.структурановогописьма("	
		|Здравствуйте! 
		|На данный момент вы используете ",a__);goto ~74;~71:__a_=0;~72:if 1=-1 then goto ~69;endif;goto ~68;~73:__a.вставить("Тело",a__);goto ~74;~74:;~75:__a_=1;if 1<=1 then goto ~79;endif;goto ~77;~76:___a=управлениеэлектроннойпочтой.написатьписьмо(глзначениепеременной("глТекущийПользователь"),__a,,,,,,истина,ложь);goto ~80;~77:;~78:___a=управлениеэлектроннойпочтой.добавить(глзначениепеременной("глТекущийПользователь"),__a,,,,,,ложь,истина);goto ~80;~79:goto ~76;~80:;~81:__a_=0;if
 -2=-2 then goto ~86;endif;goto ~85;~82:__a_=-1;~83:;~84:_a_=новый списокзначений;goto ~91;~85:if __a_=0 then goto ~87;endif;goto ~88;~86:if __a_=1 then goto ~83;endif;goto ~90;~87:goto ~91;~88:;~89:_a_=новый соответствие;goto ~91;~90:goto ~89;~91:;~92:if -2=-2 then goto ~100;endif;goto ~94;if __a_=-1 then goto ~96;endif;goto ~95;~93:goto ~99;~94:if __a_=-1 then goto ~101;endif;goto ~97;~95:goto ~103;~96:;~97:;~98:;~99:if типзнч(___a)<>тип("Структура") then goto ~104;endif;goto ~103;~100:if 1<0 then goto ~98;endif;goto ~93;
~101:;~102:if типзнч(___a)<>тип(" заданий в месяц вы не сможете обрабатывать новые задания на доставку.
		|Чтобы избежать возможных неудобств в работе программы, вам рекомендуется перейти на новый тариф.
		|Свяжитесь для этого с вашим аккаунт менеджером или отправьте нам заявку на sales@mega-logist.ru.
		|
		|
		|С уважением, 
		|команда ПО ""Мегалогист""
		|+7 (499) 649-05-35
		|sales@mega-logist.ru") then goto ~102;endif;goto ~103;~103:;goto ~114;~104:;~105:if 1>=0 then goto ~111;endif;goto ~112;~106:__a_=0;~107:;~108:возврат;goto ~113;~109:;~110:возврат;goto ~113;~111:__a_=1;goto ~108;~112:if __a_=0 then goto ~107;endif;goto ~109;~113:;goto ~114;~114:;~115:__a_=-1;~116:__a_=1;goto ~118;~117:_a_.макс(___a.письмоссылка);goto ~119;~118:_a_.вставить(___a.письмоссылка);goto ~119;~119:;~120:if -1>1 then goto ~128;endif;goto ~122;~121:__a_=-1;~122:if -1=0 then goto ~125;
endif;goto ~129;~123:;~124:управлениеэлектроннойпочтой.отправитьписьма(_a_,глзначениепеременной("глСоответствиеТекстовЭлектронныхПисем"),глзначениепеременной("глТекущийПользователь"),ложь);goto ~130;~125:;~126:управлениеэлектроннойпочтой.отправитьписьмообокончаниидействиялицензии(_a_,глзначениепеременной("глСоответствиеТекстовЭлектронныхПисем"),глзначениепеременной("глТекущийПользователь"),истина);goto ~130;~127:goto ~124;~128:if -1>=-1 then goto ~127;endif;goto ~123;~129:goto ~124;~130:;~131:if -1<>1 then goto ~138;endif;goto ~137;~132:__a_=0;~133:;~134:if a___ then goto ~140;endif;
goto ~139;~135:if a___ then goto ~139;endif;goto ~139;~136:goto ~134;~137:__a_=-1;~138:if 1>0 then goto ~136;endif;goto ~133;~139:;goto ~174;~140:;~141:if 1<-1 then goto ~147;endif;goto ~150;if __a_=-1 then goto ~143;endif;goto ~145;~142:;~143:;~144:_a__=___a.текстписьма.соответствиеэлектронныхписем();goto ~152;~145:;~146:_a__=___a.письмоссылка.получитьобъект();goto ~152;~147:if 1=-1 then goto ~148;endif;goto ~142;~148:goto ~144;~149:goto ~144;~150:if 0=-1 then goto ~149;endif;goto ~151;~151:goto ~146;~152:;
~153:if 0>1 then goto ~167;endif;goto ~163;if __a_=0 then goto ~160;endif;goto ~161;if __a_=1 then goto ~159;endif;goto ~169;~154:;~155:;~156:if __a_=-1 then goto ~172;endif;goto ~166;~157:;~158:_a__.удалить();goto ~173;~159:;~160:if __a_=1 then goto ~155;endif;goto ~157;~161:if __a_=1 then goto ~168;endif;goto ~154;~162:__a_=1;~163:__a_=1;~164:__a_=1;goto ~158;~165:goto ~158;~166:goto ~153;~167:if __a_=1 then goto ~162;endif;goto ~156;if __a_=0 then goto ~171;endif;goto ~165;~168:goto ~173;~169:;~170:_a__.вставить()
;goto ~173;~171:;~172:;~173:;goto ~174;~174:;конецпроцедуры  процедура a__(a,a_)перем _a_;~0:if 0<=1 then goto ~3;endif;goto ~5;~1:_a_=1;~2:_a_=-1;~3:_a_=-1;if _a_=1 then goto ~11;endif;goto ~13;~4:_a_=1;~5:if -1<=1 then goto ~10;endif;goto ~4;if _a_=-1 then goto ~14;endif;goto ~9;~6:;~7:a__=новый списокзначений;goto ~15;~8:;~9:goto ~7;~10:if _a_=0 then goto ~6;endif;goto ~8;~11:;~12:a__=новый списокзначений;goto ~15;~13:goto ~12;~14:goto ~15;~15:;~16:if 1=-1 then goto ~23;endif;goto ~22;~17:_a_=0;~18:_a_=-1;~19:_a_=1;goto ~21;
~20:;~21:a___="Оповещение системы ""Мегалогист""";goto ~30;~22:if 1<1 then goto ~26;endif;goto ~19;if _a_=0 then goto ~25;endif;goto ~29;~23:_a_=0;~24:_a_=0;~25:;~26:if _a_=1 then goto ~27;endif;goto ~20;~27:;~28:a___="Кому";goto ~30;~29:;~30:;~31:if 1>=-1 then goto ~37;endif;goto ~36;if _a_=1 then goto ~34;endif;goto ~32;~32:;~33:a__.очистить();goto ~38;~34:;~35:a__.установитьпараметр();goto ~38;~36:_a_=0;~37:_a_=1;goto ~33;~38:;~39:if 0<>1 then goto ~42;endif;goto ~41;if 1<0 then goto ~45;endif;goto ~43;~40:goto ~44;~41:_a_=-1
;~42:if -1<>0 then goto ~40;endif;goto ~46;~43:;~44:_a=новый запрос;goto ~48;~45:;~46:;~47:_a=новый списокзначений;goto ~48;~48:;~49:if 1>=-1 then goto ~51;endif;goto ~61;if 1<0 then goto ~57;endif;goto ~53;~50:_a_=-1;~51:_a_=0;~52:_a_=-1;goto ~56;~53:if _a_=-1 then goto ~58;endif;goto ~59;~54:;~55:;~56:_a.текст="ВЫБРАТЬ
	             |	Мегалогист_АдресаОтправки.ЭлектроннаяПочта
	             |ИЗ
	             |	РегистрСведений.Мегалогист_АдресаОтправки КАК Мегалогист_АдресаОтправки
	             |ГДЕ
	             |	Мегалогист_АдресаОтправки.Лицензия = Истина";goto ~63;~57:if _a_=1 then goto ~55;endif;goto ~54;~58:;~59:;~60:_a.началомесяца="Тема";goto ~63;~61:_a_=0;~62:_a_=1;~63:;~64:if 0=0 then goto ~78;endif;goto ~69;if 0<=1 then goto ~71;endif;
goto ~68;if -1=1 then goto ~75;endif;goto ~80;~65:goto ~81;~66:;~67:goto ~81;~68:if -1<1 then goto ~66;endif;goto ~67;~69:_a_=1;~70:_a_=0;~71:_a_=0;~72:if -1>=1 then goto ~65;endif;goto ~77;~73:if -1=1 then goto ~74;endif;goto ~82;~74:goto ~64;~75:goto ~83;~76:goto ~81;~77:goto ~83;~78:if -1<1 then goto ~72;endif;goto ~73;if -2<>-2 then goto ~79;endif;goto ~76;~79:;~80:;~81:__a=_a.началомесяца().предупреждение();goto ~84;~82:;~83:__a=_a.выполнить().выбрать();goto ~84;~84:;while __a.следующий() do ~85:_a_=-1;
~86:_a_=1;~87:_a_=0;goto ~88;~88:a__.добавить(__a.электроннаяпочта,__a.электроннаяпочта);goto ~90;~89:a__.количествозаданий(__a.доступзапрещен,__a.сообщить);goto ~90;~90:;enddo;~91:if 0=-1 then goto ~99;endif;goto ~92;if _a_=0 then goto ~96;endif;goto ~95;~92:_a_=0;goto ~97;~93:;~94:___a="ДокументСсылка.МегаЛогист_МаршрутноеЗадание"+a_+" из "+a+"  допустимых вашим тарифом маршрутных заданий.
		|При достижении "+a+"ДокументСсылка.МегаЛогист_МаршрутноеЗадание";goto ~100;~95:;~96:;~97:___a="	
		|Здравствуйте! 
		|На данный момент вы используете "+a_+" из "+a+"  допустимых вашим тарифом маршрутных заданий.
		|При достижении "+a+" заданий в месяц вы не сможете обрабатывать новые задания на доставку.
		|Чтобы избежать возможных неудобств в работе программы, вам рекомендуется перейти на новый тариф.
		|Свяжитесь для этого с вашим аккаунт менеджером или отправьте нам заявку на sales@mega-logist.ru.
		|
		|
		|С уважением, 
		|команда ПО ""Мегалогист""
		|+7 (499) 649-05-35
		|sales@mega-logist.ru";goto ~100;~98:;~99:if _a_=0 then goto ~98;endif;goto ~93;~100:;~101:_a_=-1;~102:_a_=0;~103:
_a_=-1;goto ~105;~104:if a__.установитьпараметр()>0 then goto ~101;endif;goto ~106;~105:if a__.количество()>0 then goto ~107;endif;goto ~106;~106:;goto ~121;~107:;~108:if 1>=-1 then goto ~118;endif;goto ~111;if _a_=1 then goto ~110;endif;goto ~113;~109:_a_=0;~110:if _a_=-1 then goto ~116;endif;goto ~114;~111:_a_=-1;~112:_a_=0;~113:_a_=-1;~114:;~115:a_(a__,a___,___a,ложь);goto ~120;~116:;~117:a_(a__,a___,___a,истина);goto ~120;~118:_a_=1;~119:_a_=1;goto ~115;~120:;goto ~121;~121:;конецпроцедуры
  функция проверка()экспорт перем _a;~0:if -1>0 then goto ~8;endif;goto ~5;if 1<=1 then goto ~4;endif;goto ~2;~1:goto ~7;~2:;~3:a=10000000;goto ~9;~4:;~5:if -1<1 then goto ~1;endif;goto ~6;~6:;~7:a=9999999;goto ~9;~8:_a=1;~9:;~10:_a=1;~11:_a=-1;if _a=1 then goto ~12;endif;goto ~15;~12:;~13:a_=истина;goto ~16;~14:a_=ложь;goto ~16;~15:goto ~14;~16:;~17:_a=-1;~18:_a=-1;if 1>0 then goto ~22;endif;goto ~20;~19:a__=a();goto ~23;~20:;~21:a__=a();goto ~23;~22:goto ~19;~23:;~24:if -1<1 then goto ~40;endif;goto ~44;
if 1>=0 then goto ~42;endif;goto ~38;if 0<1 then goto ~33;endif;goto ~45;~25:_a=1;~26:_a=-1;goto ~32;~27:goto ~24;~28:;~29:if a__<=новый списокзначений*a then goto ~29;endif;goto ~46;~30:if _a=1 then goto ~39;endif;goto ~37;~31:;~32:if a__>=1.1*a then goto ~47;endif;goto ~46;~33:;~34:if 0=0 then goto ~28;endif;goto ~36;~35:goto ~46;~36:goto ~32;~37:;~38:if 0<=1 then goto ~27;endif;goto ~31;~39:;~40:if 1>=0 then goto ~26;endif;goto ~34;~41:_a=-1;~42:_a=0;~43:;~44:if _a=1 then goto ~30;endif;goto ~25;if
 _a=0 then goto ~35;endif;goto ~43;~45:;~46:;goto ~79;~47:;~48:if 1<0 then goto ~58;endif;goto ~54;if _a=1 then goto ~64;endif;goto ~62;if _a=0 then goto ~51;endif;goto ~71;~49:;~50:if _a=1 then goto ~55;endif;goto ~57;~51:goto ~48;~52:goto ~70;~53:if 1>=0 then goto ~60;endif;goto ~56;~54:if 1<=-1 then goto ~65;endif;goto ~61;if _a=1 then goto ~52;endif;goto ~66;~55:;~56:goto ~70;~57:;~58:if 1<=-1 then goto ~53;endif;goto ~50;~59:_a=1;~60:goto ~70;~61:_a=-1;goto ~70;~62:if -2<=-2 then goto ~67;endif;goto ~63;
~63:goto ~68;~64:_a=1;~65:if _a=-1 then goto ~69;endif;goto ~49;~66:;~67:;~68:предупреждение("Тема");goto ~72;~69:;~70:предупреждение("Вы превысили тариф использования Мегалогиста");goto ~72;~71:;~72:;~73:_a=-1;if -1<1 then goto ~77;endif;goto ~75;~74:a_=ложь;goto ~78;~75:;~76:a_=истина;goto ~78;~77:goto ~76;~78:;goto ~79;~79:;~80:_a=1;if 0<=1 then goto ~81;endif;goto ~87;if -1<=1 then goto ~82;endif;goto ~84;~81:if _a=-1 then goto ~86;endif;goto ~88;~82:;~83:if a__>=0.85*a then goto ~90;endif;goto ~89;~84:;~85:if a__>новый структура/a
 then goto ~83;endif;goto ~89;~86:;~87:_a=-1;~88:goto ~83;~89:;goto ~146;~90:;~91:if -1<=0 then goto ~106;endif;goto ~108;~92:_a=0;if 0<0 then goto ~93;endif;goto ~104;~93:goto ~113;~94:;~95:a__(a,a__);goto ~113;~96:;~97:;~98:a__(a,a__);goto ~113;~99:goto ~95;~100:;~101:goto ~91;~102:;~103:;~104:;~105:goto ~91;~106:if 0>1 then goto ~109;endif;goto ~107;if -2=-2 then goto ~101;endif;goto ~100;~107:if 0<=1 then goto ~99;endif;goto ~103;~108:if _a=1 then goto ~111;endif;goto ~110;if 1>=0 then goto ~102;endif;goto ~97;
~109:if -1<>1 then goto ~96;endif;goto ~112;~110:if _a=0 then goto ~94;endif;goto ~105;~111:_a=1;~112:;~113:;~114:if 0=-1 then goto ~125;endif;goto ~128;~115:_a=0;if _a=1 then goto ~127;endif;goto ~118;~116:;~117:goto ~131;~118:;~119:;~120:a___="	
		|На данный момент вы используете "+a__+" из "+a+"  допустимых вашим тарифом маршрутных заданий.
		|При достижении "+a+" заданий в месяц вы не сможете обрабатывать новые задания на доставку.
		|Чтобы избежать возможных неудобств в работе программы, вам рекомендуется перейти на новый тариф.
		|Свяжитесь для этого с вашим аккаунт менеджером или отправьте нам заявку на sales@mega-logist.ru.
		|
		|
		|С уважением, 
		|команда ПО ""Мегалогист""
		|+7 (499) 649-05-35
		|sales@mega-logist.ru";goto ~135;~121:_a=1;~122:goto ~120;~123:;~124:goto ~131;~125:if _a=1 then goto ~134;endif;goto ~121;if -1<=1 then goto ~130;endif;goto ~126;~126:;~127:goto ~114;~128:if 0<>1 then goto ~133;endif;goto ~132;~129:_a=1
;~130:;~131:a___="ВЫБРАТЬ
	             |	Мегалогист_АдресаОтправки.ЭлектроннаяПочта
	             |ИЗ
	             |	РегистрСведений.Мегалогист_АдресаОтправки КАК Мегалогист_АдресаОтправки
	             |ГДЕ
	             |	Мегалогист_АдресаОтправки.Лицензия = Истина"+a__+" из "+a+"Товары"+a+"КонДата";goto ~135;~132:if _a=-1 then goto ~124;endif;goto ~123;~133:if 0=0 then goto ~122;endif;goto ~119;~134:if _a=0 then goto ~117;endif;goto ~116;~135:;~136:if 1<-1 then goto ~138;endif;goto ~139;if 0<1 then goto ~141;endif;goto ~143;~137:goto ~145;~138:_a=0;~139:if 1>=1 then goto ~140;endif;goto ~137;~140:goto ~142;~141:;~142:сообщить(a___);goto ~145;~143:;~144:сообщить(a___);goto ~145;~145:;goto ~146;~146:;~147:if 1>=-1 then goto ~154;endif;
goto ~151;~148:_a=-1;~149:;~150:возврат a_;goto ~157;~151:if _a=0 then goto ~149;endif;goto ~155;~152:;~153:goto ~150;~154:if -1<>0 then goto ~153;endif;goto ~152;~155:;~156:возврат a_;goto ~157;~157:;конецфункции
